{"type": "root", "attrs": {"icon": "path/to/icon.svg", "namespace": "labs", "version": "1.0"}, "body": [{"level": 0, "type": "title", "indent": 0, "text": ["Ruler"], "extent": [0, 10]}, {"type": "summary", "indent": 0, "text": [" Measures distances on geometry. "], "extent": [67, 108]}, {"level": 0, "type": "title", "indent": 0, "text": ["Overview"], "extent": [108, 121]}, {"type": "para", "indent": 0, "text": ["Use this tool to draw out quick measurements in the viewport. Note that this tool is currently limited to only working in the Sop context."], "extent": [121, 262]}, {"type": "para", "indent": 0, "text": ["Click and drag on the currently displayed geometry to draw out a measurement on it. The measurement represents the distance between the point on the geometry initially clicked on and the point currently being hovered on. "], "extent": [262, 485]}, {"type": "para", "indent": 0, "text": ["You can draw out multiple measurements. They will persist in the viewport until a new state is entered, at which point they will be destroyed. The only states that are an exception to this are the selection state and the view state. This allows you to continue to tumble around while still putting down measurements."], "extent": [485, 803]}, {"type": "para", "indent": 0, "text": ["Press the Undo hotkey to remove a measurement (default is 'z')."], "extent": [803, 868]}, {"type": "para", "indent": 0, "text": ["Press the Copy to Clipboard hotkey to copy the most recent measurement to the clipboard (default is 'q')."], "extent": [868, 975]}, {"type": "para", "indent": 0, "text": ["Press the Pop Copy hotkey to copy to clipboard and remove the most recent measurement (default is 'f')."], "extent": [975, 1080]}, {"type": "para", "indent": 0, "text": ["The state will respect point snapping if it is currently enabled."], "extent": [1080, 1147]}, {"type": "para", "indent": 0, "text": ["The state will intersect against one of the principle planes (the xy, xz, and yz planes) if no geometry is underneath the cursor."], "extent": [1147, 1278]}, {"type": "para", "indent": 0, "text": ["Angle snapping can be enabled by holding down Ctrl while dragging. This will find the angle between the vector of the current measurement and the most reasonable axis, based on the current view, if the measurement were to be projected onto the most reasonable principle plane that contains that axis. It will then take that angle, and snap it to the closest multiple of 15, in degrees."], "extent": [1278, 1665]}, {"type": "para", "indent": 0, "text": ["Note: There are currently issues with point snapping and angle snapping when object level transforms are present."], "extent": [1665, 1780]}, {"type": "para", "indent": 0, "text": ["Note: Its not advisable to have object level scales when using this tool. If they are present, the measurement will account for them. This puts the measurement value in object space units, whereas SOP parameters expect values to be in sop-local units. To convert for uniform scales at the object level, you should divide the measurement value by the object uniform scale. For non-uniform object scales however, there is no simple conversion and it depends on the direction of the measurement. ]]></helpText>"], "extent": [1780, 2288]}], "title": ["Overview"], "summary": [" Measures distances on geometry. "]}