{"type": "root", "attrs": {"type": "include"}, "body": [{"type": "para", "indent": 0, "text": ["The style may be one of:"], "extent": [16, 42]}, {"type": "bullet_group", "body": [{"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["min"]}, " – Choose the value of the sample with the smallest z value (closest to camera)."], "extent": [42, 132]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["max"]}, " – Choose the value of the sample with the maximum z value (farthest from camera)."], "extent": [132, 224]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["median"]}, " – Choose the value of the sample that has the median z value of all samples."], "extent": [224, 314]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["edge"]}, " – Filter using a unit box but only averages samples with object coverage.  This filter will have the effect of disabling external edge antialiasing."], "extent": [314, 474]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["ocover"]}, " – First, choose the object which covers most of the pixel, then take the average value from the sub-pixels of that object only.  This filter is similar to ", {"type": "code", "text": ["edge"]}, " but it also disables internal edge antialiasing between object boundaries."], "extent": [474, 724]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["idcover"]}, " – First, choose the object which covers most of the pixel, then select a single sample from that object for the pixel value.  This filter is similar to ", {"type": "code", "text": ["ocover"]}, " but it will not average any samples.  Use this filter mode for planes that will be interpreted as integers, such as object or primitive identifiers.  The sample chosen will be unordered."], "extent": [724, 1086]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["omin"]}, " – First, choose the object which covers most of the pixel, then choose a single sample from that object for the pixel value.  Chooses the sample with the smallest z value (closest to camera)."], "extent": [1086, 1289]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["omax"]}, " – First, choose the object which covers most of the pixel, then choose a single sample from that object for the pixel value.  Chooses the sample with the maximum z value (farthest)."], "extent": [1289, 1482]}, {"blevel": 2, "type": "bullet", "indent": 0, "text": [{"type": "code", "text": ["omedian"]}, " – First, choose the object which covers most of the pixel, then choose a single sample from that object for the pixel value.  Chooses the sample with the median z value."], "extent": [1482, 1665]}], "container": true}]}