{"type": "root", "attrs": {"type": "node", "context": "out", "internal": "labs::vertex_animation_textures::3.0", "icon": "vertexanimationtextures", "tags": "sidefxlabs, gamedev ", "version": "3.0", "namespace": "labs"}, "body": [{"level": 0, "type": "title", "indent": 0, "text": ["Labs Vertex Animation Textures"], "extent": [0, 35]}, {"type": "summary", "indent": 0, "text": [" The Vertex Animation Textures ROP will export a mesh and a set of textures to be used with a shader for complex real-time effects, such as: soft-body deformation, rigid-body dynamics, dynamically remeshed geometries, and particle sprites. "], "extent": [170, 418]}, {"type": "para", "indent": 0, "text": ["Vertex Animation Textures (VAT) is an efficient and powerful solution to recreate complex and non-traditional animations in real time. Because VAT only uses textures and shaders to achieve the visuals on the GPU, it has a much lighter performance impact on the CPU, compared to traditional skeletal mesh animations. This also makes VAT a good candidate to animate a large number of instanced meshes with per-instance variations."], "extent": [418, 848]}, {"type": "para", "indent": 0, "text": ["Furthermore, VAT comes in handy when a skeletal animation rig is too complicated to be imported to the real-time engine. You can import the rig into Houdini and directly export the animated geometry through VAT, because all VAT needs is the points/vertices and the data on them on each frame."], "extent": [848, 1142]}, {"type": "para", "indent": 0, "text": ["Vertex animations encoded in textures do not have to be played in complete loops or at a constant speed. You can start/stop at any frame or art direct the playback speed."], "extent": [1142, 1314]}, {"type": "para", "indent": 0, "text": ["The limitations of VAT include: texture memory budget on lower-end hardwares, the lack of animated collisions, and relatively limited real-time interactability."], "extent": [1314, 1476]}, {"type": "para", "indent": 0, "text": ["Compared to previous versions, VAT 3.0 offers more streamlined workflows, additional advanced features, and a lot more customizability."], "extent": [1476, 1614]}, {"level": 1, "id": "parameters", "container": true, "type": "parameters_section", "indent": 0, "role": "section", "extent": [1614, 1626], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Render All"], "extent": [1626, 1642], "body": [{"type": "para", "indent": 8, "text": ["Cooks all dependent networks and renders all the assets specified on the ", {"type": "strong", "text": ["Export"]}, " tab. In Dynamic Remeshing (Fluid) mode, there are two render passes and this cooks all the assets pertaining to the currently selected render pass."], "extent": [1642, 1880]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Mode / Target Engine"], "extent": [1880, 1906], "body": [{"type": "para", "indent": 8, "text": [{"type": "strong", "text": ["Mode"]}, " depends on what kind of animation you want to export. ", {"type": "strong", "text": ["Target Engine"]}, " affects the coordinate system, the scale, and potentially some other engine-specific parameters. See the information on the ", {"type": "strong", "text": ["Input"]}, " tab for how to prepare your input geometry for a specific mode-and-engine combination.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Soft-Body Deformation (Soft)"]}, ": the surfaces have consistent topologies; they simply deform."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Rigid-Body Dynamics (Rigid)"]}, ": packed pieces with RBD simulation data."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Dynamic Remeshing (Fluid)"]}, ": the surfaces are potentially remeshed every frame with dynamic topologies."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Particle Sprites (Sprite)"]}, ": points with particle simulation data."]}], "extent": [1906, 2605]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Start/End"], "extent": [2605, 2620], "body": [{"type": "para", "indent": 8, "text": ["The first frame and last frame of the animation to export. Both ends are inclusive."], "extent": [2620, 2712]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Input Geometry"], "extent": [2712, 2732], "body": [{"type": "para", "indent": 8, "text": ["The path to the geometry node that you want to render."], "extent": [2732, 2795]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Settings: Soft-Body Deformation"], "extent": [2795, 2835], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Export Compressed Normals in Position Alpha"], "extent": [2835, 2884], "body": [{"type": "para", "indent": 8, "text": ["Compresses the normals from the vector type to the float type and stores them in Position Texture’s alpha channel. This is a lossy compression resulting in medium-quality normals. If you do not plan to apply (tangent-space) surface normal maps to your real-time asset, this is a more memory-efficient alternative as it bypasses the cost of sampling Rotation Texture. But if you want to apply surface normal maps, turn this off and use Rotation Texture instead. Turning this on also precludes you from exporting a custom attribute through Position Texture’s alpha channel."], "extent": [2884, 3464]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Settings: Rigid-Body Dynamics"], "extent": [3464, 3502], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Pivot Accuracy"], "extent": [3502, 3522], "body": [{"type": "para", "indent": 8, "text": ["The vertices on every rigid-body piece are transformed relative to the piece’s pivot. Therefore, the accuracy of the pivot encoding determines the accuracy of piece translations and rotations throughout the animation.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["High"]}, ": select this if your vertex shader is a performance bottleneck; uses two 16-bit UV channels to store unencoded pivots; the overall cheapest option."]}, " \n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Very High"]}, ": recommended; uses two 16-bit UV channels to store encoded pivots; deploys two split-encoding formats and dynamically pick the better format for each piece, producing an accuracy very close to that of ", {"type": "q", "text": ["Maximum"]}, " at only half of the latter’s memory footprint; costs more vertex shader instructions."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Maximum"]}, ": select this only if you absolutely need the highest possible accuracy; uses two 32-bit UV channels to store unencoded pivots; in Unreal Engine, you have to turn on ", {"type": "strong", "text": ["Use Full Precision UVs"]}, " in Mesh Editor, otherwise the actual accuracy is slightly worse than ", {"type": "q", "text": ["High"]}, ". Because Rigid-Body Dynamics (Rigid) mode requires 4-6 UV channels on the exported mesh, turning on Use Full Precision UVs doubles the memory footprints for all of them."]}], "extent": [3522, 4704]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Rotation Interpolation"], "extent": [4704, 4732], "body": [{"type": "para", "indent": 8, "text": ["Select ", {"type": "q", "text": ["Accurate Multi-RPF Slerp with Angular Velocity"]}, " unless your input geometry cannot provide the angular velocity attribute ", {"type": "q", "text": ["w"]}, ". If your input geometry comes from a RBD simulation, angular velocity is directly available. Simply make sure the attribute is included in the simulation output attributes and that it is transferred to points.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Accurate Multi-RPF Slerp with Angular Velocity"]}, ": uses an angular-velocity-assisted spherical linear interpolation (slerp) algorithm to fairly accurately interpolate rotations of fast-spinning pieces; capable of interpolating pieces that spin much faster than 360 degrees per integer frame (multi-revolutions per frame); also capable of handling the edge case where a piece rotates to the exact same orientation as that of the previous frame; allows you to freely dilate time in real-time playbacks."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Basic Short-Path Slerp without Angular Velocity"]}, ": uses the standard short-path spherical linear interpolation (slerp) algorithm that does not require the input angular velocity; this limits accurate rotation interpolations to pieces that spin less than 180 degrees per inter frame; when any piece spins faster than that, its interpolation will be incorrect."]}], "extent": [4732, 5972]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Support Smoothly Interpolated Trajectories"], "extent": [5972, 6020], "body": [{"type": "para", "indent": 8, "text": ["This requires you to export Color Texture and set Texture Format to ", {"type": "q", "text": ["HDR"]}, ". It recomputes accelerations and exports them through the RGB channels of Color Texture. Using accelerations, the shader can reconstruct curved interframe trajectories in a more realistic way which take velocites into account, instead of constructing straight paths to connect adjacent-frame positions."], "extent": [6020, 6405]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Max RPF Allowed"], "extent": [6405, 6426], "body": [{"type": "para", "indent": 8, "text": ["If the maximum RPF (revolutions per frame) ever reached in the animation by any piece is too high, it may affect the accuracy of the rotation interpolation for all pieces due to floating point precision limitations. Set this parameter to a reasonably high number prevents extremely fast-spinning outlier pieces from causing that problem."], "extent": [6426, 6772]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Slerp Edge Case Offset"], "extent": [6772, 6800], "body": [{"type": "para", "indent": 8, "text": ["Helps to resolve the edge case where a piece rotates to the exact same orientation as that of the previous frame. The slerp function is not defined for rotations that are exact multiples of 360 degrees. The solution is therefore to slightly rotate any edge-case piece towards or away from its next frame’s orientation. On even frames, it will rotate forward in time by a random degree between 50% and 150% the value of this parameter; on odd frames, it will rotate backward in time by a random degree between -50% and -150% the value of this parameter. Do not set this value too low, or the real-time shader may suffer from numerical errors."], "extent": [6800, 7450]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Slerp Edge Case Seed"], "extent": [7450, 7476], "body": [{"type": "para", "indent": 8, "text": ["A global random seed that contributes to (but not solely responsible for) generating random degrees by which to rotate edge-case pieces (see the tooltip of Slerp Edge Case Offset). It is extremely unlikely that you will need to change this parameter. Only change it if the node displays an error message that asks you to do so."], "extent": [7476, 7812]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Settings: Dynamic Remeshing"], "extent": [7812, 7848], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Render Pass"], "extent": [7848, 7865], "body": [{"type": "para", "indent": 8, "text": ["Dynamic Remeshing (Fluid) mode requires you to render output files in two separate passes in order to reduce the texture memory consumption. Leave this at ", {"type": "q", "text": ["First Pass"]}, " when you are configuring the node’s settings, and then press ", {"type": "strong", "text": ["Render All"]}, ". After the first pass is complete, change this to ", {"type": "q", "text": ["Second Pass"]}, " and press ", {"type": "strong", "text": ["Render All"]}, " again. (Almost all other parameters are locked during the second pass, because you are not allowed to change setting between the two passes.) If ", {"type": "strong", "text": ["Preview Texture Size"]}, " is on, this parameter decides which pass’s texture size to preview.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["First Pass"]}, ": renders Geometry, Lookup Table Texture, and optionally the Real-Time Data JSON file / the Unity Material file. "]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Second Pass"]}, ": renders the animation data textures (i.e. Position Texture, Rotation Texture, Color Texture, etc.), which are much smaller in size than Lookup Table Texture."]}], "extent": [7865, 8767]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Enable Fuse"], "extent": [8767, 8784], "body": [{"type": "para", "indent": 8, "text": ["Turn this off if you do not want to fuse any points."], "extent": [8784, 8845]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Fuse Point Group"], "extent": [8845, 8867], "body": [{"type": "para", "indent": 8, "text": ["The point group that will be affected by fusing. Points will be fused together if they are within the distance threshold set by ", {"type": "strong", "text": ["Fuse Distance"]}, ". You can also use the ", {"type": "q", "text": ["!group_name"]}, " or ", {"type": "q", "text": ["* ^group_a_name ^group_b_name"]}, " syntax to exclude certain groups. When this parameter is blank, all points will be affected."], "extent": [8867, 9183]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Fuse Distance"], "extent": [9183, 9202], "body": [{"type": "para", "indent": 8, "text": ["Fuses together points within this distance to one another in the input geometry. This helps to remove tiny triangles that are a waste of resources and potentially problematic."], "extent": [9202, 9386]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Export Compressed Normals in Position Alpha"], "extent": [9386, 9435], "body": [{"type": "para", "indent": 8, "text": ["Compresses the normals from the vector type to the float type and stores them in Position Texture’s alpha channel. This is a lossy compression resulting in medium-quality normals. If you do not plan to apply regular (tangent-space) surface normal maps to your real-time asset, this is a more memory-efficient alternative as it bypasses the cost of sampling Rotation Texture. But if you want to apply regular normal maps, turn this off and use Rotation Texture instead. Turning this on also precludes you from exporting a custom attribute through Position Texture’s alpha channel."], "extent": [9435, 10023]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Export Surface UVs in Position Alpha and Color Alpha"], "extent": [10023, 10081], "body": [{"type": "para", "indent": 8, "text": ["Exports the animated UV attributes through Position Texture’s alpha channel and Color Texture’s alpha channel. Dynamic Remeshing (Fluid) mode can support UV maps, but since the topology is dynamic, the input geometry has to be UV unwrapped on every frame. You can either UV unwrap the input geometry yourself (recommended) or rely on the auto UV generation method specified on the ", {"type": "strong", "text": ["Input"]}, " tab."], "extent": [10081, 10483]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Export Surface UVs in Color Red and Green"], "extent": [10483, 10530], "body": [{"type": "para", "indent": 8, "text": ["Exports the animated UV attributes through Color Texture’s red and green channels. Dynamic Remeshing (Fluid) mode can support UV maps, but since the topology is dynamic, the input geometry has to be UV unwrapped on every frame. You can either UV unwrap the input geometry yourself (recommended) or rely on the auto UV generation method specified on the ", {"type": "strong", "text": ["Input"]}, " tab."], "extent": [10530, 10904]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Settings: Particle Sprites"], "extent": [10904, 10939], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Support Particle Interframe Interpolation"], "extent": [10939, 10986], "body": [{"type": "para", "indent": 8, "text": ["Changes how the data are arranged on the output textures to make it possible to interpolate particle attributes in real time. This requires the input geometry to have the point attribute ", {"type": "q", "text": ["id"]}, "."], "extent": [10986, 11187]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Card Shape"], "extent": [11187, 11203], "body": [{"type": "para", "indent": 8, "text": ["Set the shape of the particle card geometry. Different shapes have slightly different performance impacts. But all shapes share the same centre in UV space."], "extent": [11203, 11368]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Square Orientation"], "extent": [11368, 11392], "body": [{"type": "para", "indent": 8, "text": ["How the square particle cards will be oriented in UV space and real-time view space."], "extent": [11392, 11485]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Triangle Orientation"], "extent": [11485, 11511], "body": [{"type": "para", "indent": 8, "text": ["How the triangular particle cards will be oriented in UV space and real-time view space."], "extent": [11511, 11608]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Hexagon Orientation"], "extent": [11608, 11633], "body": [{"type": "para", "indent": 8, "text": ["How the hexagonal particle cards will be oriented in UV space and real-time view space."], "extent": [11633, 11729]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Custom ZX Shapes"], "extent": [11729, 11751], "body": [{"type": "para", "indent": 8, "text": ["Replaces the default shape options with your own designs. The custom shape geometry has to be flat on the ZX plane. You can merge multiple shape variants together and point this parameter to the path of the combined geometry. See the tooltip of Multiple Shape Variants with Shape ID Attribute."], "extent": [11751, 12053]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Shape Input Type"], "extent": [12053, 12075], "body": [{"type": "para", "indent": 8, "text": ["The custom shapes can either be filled polygons or simply outlines defined by closed curves with no interiors. The hollow outlines will be automatically filled. For performance reasons, consider using a Fuse SOP to reduce the number of points used to define the input custom shapes."], "extent": [12075, 12366]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Multiple Shape Variants with Shape ID Attribute"], "extent": [12366, 12419], "body": [{"type": "para", "indent": 8, "text": ["When you merge multiple shape variants together (because Custom ZX Shapes only accepts one geometry path), they can still be uniquely identified if you assign each shape a unique shape ID value."], "extent": [12419, 12622]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Shape ID Attribute"], "extent": [12622, 12646], "body": [{"type": "para", "indent": 8, "text": ["A point or primitive integer attribute to distinguish different shape variants."], "extent": [12646, 12734]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Shape Weight Attribute"], "extent": [12734, 12762], "body": [{"type": "para", "indent": 8, "text": ["A point or primitive float attribute to determine the distribution of the shape variants. Each variant’s likelihood of adoption by a particle is this variant’s weight divided by the aggregate weight of all variants."], "extent": [12762, 12986]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Preserve Relative Scales of Different Shapes"], "extent": [12986, 13036], "body": [{"type": "para", "indent": 8, "text": ["Preserves the relative scale differences between multiple variants. Turn this off if you want to scale (the width-to-height ratio will be locked) different shape variants to have the same bounding square size."], "extent": [13036, 13254]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Reverse Custom Card Normals"], "extent": [13254, 13287], "body": [{"type": "para", "indent": 8, "text": ["Turn this on only if the particle cards have the wrong normals in your real-time engine, in which case, they may appear to be invisible but if you select the object, you can see the outlines. This is unlikely to happen, however."], "extent": [13287, 13524]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Settings: All Modes"], "extent": [13524, 13552], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Input Geometry Is Cached to Integer Frames"], "extent": [13552, 13600], "body": [{"type": "para", "indent": 8, "text": ["Set this according to whether or not the input geometry is cached to integer frames and loaded from disk. Caching the input geometry is the recommended workflow as it shortens this node’s render time, especially if the input depends on expensive simulations or nodes that are slow to recook."], "extent": [13600, 13900]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Lookup Table Format"], "extent": [13900, 13925], "body": [{"type": "para", "indent": 8, "text": ["Typically it is sufficient to select ", {"type": "q", "text": ["Non-HDR"]}, " and ", {"type": "q", "text": [".png"]}, " / ", {"type": "q", "text": [".tga"]}, " for Lookup Table Texture to keep the memory consumption low. In Unreal Engine, if your Dynamic Remeshing (Fluid) mode animation has glitches, the first thing is to do is to restart Unreal Editor. (This is known to fix glitches that occur after newly imported files.) If the glitches persist, consider turning on ", {"type": "strong", "text": ["Use Full Precision UVs"]}, " in Mesh Editor. Only change this to ", {"type": "q", "text": ["HDR"]}, " and ", {"type": "q", "text": [".exr"]}, " / ", {"type": "q", "text": [".tiff"]}, " if your second pass texture size is huge and all other solutions have failed to get rid of the glitches."], "extent": [13925, 14505]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Texture Format"], "extent": [14505, 14525], "body": [{"type": "para", "indent": 8, "text": ["Select ", {"type": "q", "text": ["HDR"]}, " if your performance budget can afford it, because it offers better precision for all the data you are exporting. Only EXR and TIFF extensions can support HDR, but all extensions can support non-HDR. If your animation spans a huge area, the data precision will be pushed to its limit and non-HDR formats may result in noticeable issues; consider switching to HDR formats or dividing the animation into several smaller local parts. In your real-time engine, match the texture compression setting with this setting (see the tooltip of Pad Texture Size to Powers of Two for an exception)."], "extent": [14525, 15131]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Split Positions into Two Textures"], "extent": [15131, 15170], "body": [{"type": "para", "indent": 8, "text": ["Uses two 8-bit textures for better precision when the target engine does not support 16/32-bit HDR textures. You must use both textures when this is on. The node automatically prevents you from accessing this option if you want to use a HDR Position Texture, but you can override this restriction in the ", {"type": "strong", "text": ["Advanced"]}, " tab."], "extent": [15170, 15498]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Export Spare Color Texture"], "extent": [15498, 15530], "body": [{"type": "para", "indent": 8, "text": ["Spare Color Texture exports the point vector attribute ", {"type": "q", "text": ["Cd2"]}, " and the point float attribute ", {"type": "q", "text": ["Alpha2"]}, " on the input geometry. It is useful when you want to export a second set of animated colors. You can also use it to export the actual colors when Color Texture is occupied by non-color data. Color Texture is designed to be a multi-purpose texture whereas Spare Color Texture is more of a pure color texture. But of course, you can still write non-color data into ", {"type": "q", "text": ["Cd2"]}, " and ", {"type": "q", "text": ["Alpha2"]}, "."], "extent": [15530, 16021]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Export Static Mesh Vertex Colors"], "extent": [16021, 16059], "body": [{"type": "para", "indent": 8, "text": ["To export vertex colors, create the attributes ", {"type": "q", "text": ["Cd_v"]}, " and ", {"type": "q", "text": ["Alpha_v"]}, " on vertices as opposed to points. This is to clearly differentiate between animated point/piece/particle colors, which are exported through the textures, and unchanging vertex colors, which are exported through the static mesh. Vertex colors can be used for masking and other purposes. Dynamic Remeshing (Fluid) mode does not have the concept of static vertex colors, since there is no consistent topology. Particle Sprites (Sprite) mode only exports static vertex colors if they exist on the geometry from Custom ZX Shapes."], "extent": [16059, 16660]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Include Hidden Debug Plane in Geometry"], "extent": [16660, 16704], "body": [{"type": "para", "indent": 8, "text": ["It is recommended to turn this on. When the real-time shader is not in the debug mode, the plane is not rendered and incurs next to no cost. Turning it off makes it harder to debug the real-time shader. (This feature is currently only supported with Unreal Engine.)\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["Prior to Vertex Animation Textures ROP 3.0, you needed to set a list of parameter values in the real-time shader. Those data are now embedded in the bounds of the static mesh and automatically derived at runtime. Turn this on to include a simple square in the exported static mesh to display the embedded data when the shader is in the debug mode."]}], "extent": [16704, 17341]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["In Position Alpha"], "extent": [17341, 17364], "body": [{"type": "para", "indent": 8, "text": ["A custom float attribute you want to export through Position Texture’s alpha channel. This attribute can have any non-negative values, including values above 1.0, even when using non-HDR texture formats. But in order to support this, negative values are not allowed."], "extent": [17364, 17639]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["In Color"], "extent": [17639, 17653], "body": [{"type": "para", "indent": 8, "text": ["A custom vector attribute you want to export through Color Texture’s RGB channels. This attribute does not undergo any transform, conversion, or normalization. If the attribute has values outside the 0-1 range, set Texture Format to ", {"type": "q", "text": ["HDR"]}, ". If you have to use a non-HDR texture, you can pre-normalize the attributes in the input geometry and manually reverse the normalization in the real-time shader."], "extent": [17653, 18062]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["In Color Alpha"], "extent": [18062, 18082], "body": [{"type": "para", "indent": 8, "text": ["A custom float attribute you want to export through Color Texture’s alpha channel. This attribute does not undergo any transform, conversion, or normalization. If the attribute has values outside the 0-1 range, set Texture Format to ", {"type": "q", "text": ["HDR"]}, ". If you have to use a non-HDR texture, you can pre-normalize the attributes in the input geometry and manually reverse the normalization in the real-time shader."], "extent": [18082, 18491]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Lookup Table Width"], "extent": [18491, 18515], "body": [{"type": "para", "indent": 8, "text": ["The target width of Lookup Table Texture. In Dynamic Remeshing (Fluid) mode, ", {"type": "strong", "text": ["Target Texture Width"]}, " can generally be less than half of this value, as Lookup Table Texture tends to be many times larger than the animation data textures.  \n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["You can turn on ", {"type": "strong", "text": ["Preview Texture Size"]}, " to help you decide this value. Try to avoid creating textures that are too wide and short, or too narrow and tall. In Unreal Engine, if either the texture width or the height is much larger than 4096, consider turning on ", {"type": "strong", "text": ["Use Full Precision UVs"]}, " in Mesh Editor if the animation has glitches."]}], "extent": [18515, 19106]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Target Texture Width"], "extent": [19106, 19132], "body": [{"type": "para", "indent": 8, "text": ["The target width of the output textures. If there are fewer data points per frame than this value, the output textures use the number of data points as their widths.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["You can turn on ", {"type": "strong", "text": ["Preview Texture Size"]}, " to help you decide this value. Try to avoid creating textures that are too wide and short, or too narrow and tall. In Unreal Engine, if either the texture width or the height is much larger than 4096 and the animation has glitches, consider turning on ", {"type": "strong", "text": ["Use Full Precision UVs"]}, " in Mesh Editor if the animation has glitches."]}], "extent": [19132, 19683]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Preview Texture Size (Slow)"], "extent": [19683, 19716], "body": [{"type": "para", "indent": 8, "text": ["Turn this on to interactively preview the output texture size. It is somewhat slow because every time you toggle this on or some upstream parameter updates, the node will need to recheck the input geometry on every frame of the export frame range. But once it is on, updating Target Texture Width will have instant feedback. In Dynamic Remeshing (Fluid) mode, the two passes have two different texture sizes, so which preview size is displayed depends on ", {"type": "strong", "text": ["Render Pass"]}, "."], "extent": [19716, 20194]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Pad Texture Size to Powers of Two"], "extent": [20194, 20233], "body": [{"type": "para", "indent": 8, "text": ["You normally do not need to pad animation data textures to powers of two in dimensions, because as data textures, they should not be streamed. But if the target engine or hardware only accepts powers of two textures, turn this on. In Unreal Engine, sometimes there are issues with power-of-two textures that have data in their alpha channels, in which case, consider using the HDR compression setting in engine even if you exported those textures in non-HDR formats in Houdini."], "extent": [20233, 20719]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Input"], "extent": [20719, 20733], "body": [{"type": "tip_group", "body": [{"type": "tip", "indent": 4, "role": "item", "extent": [20733, 20742], "body": [{"type": "para", "indent": 8, "text": ["Follow the input requirement checklist, which is specific to the current mode and target engine. Expand Legend to see more information."], "extent": [20742, 20886]}], "container": true}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Input: Attribute Auto Generation"], "extent": [20886, 20927], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["UV Generation"], "extent": [20927, 20946], "body": [{"type": "para", "indent": 8, "text": ["Even though the vertex attribute ", {"type": "q", "text": ["uv"]}, " is listed as an optional attribute, it is required implicitly. The node simply auto-computes UVs if they are missing from the input geometry. When they are not missing, you still have the option to have this node recompute them for you, but that is a less transparent workflow. Consider using Labs Auto UV SOP when preparing the input geometry.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["UV Unwrap"]}, ": faster; many more disjoint UV islands; fewer rotated islands in the UV layout."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["UV Autoseam and Flatten"]}, ": slower but generally better quality; fewer disjoint UV islands; more rotated islands in the UV layout."]}], "extent": [20946, 21589]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Normal Generation"], "extent": [21589, 21612], "body": [{"type": "para", "indent": 8, "text": ["Even though the vertex attribute ", {"type": "q", "text": ["N"]}, " is listed as an optional attribute, it is required implicitly. The node simply auto-computes normals if they are missing from the input geometry. When they are not missing, you still have the option to have this node recompute them for you, but that is a less transparent workflow.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Vertex Angle"]}, ": sets the internal Normal SOP to run on vertices with a Cusp Angle of 60 and a Weighting Method of ", {"type": "q", "text": ["By Vertex Angle"]}, "."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Face Area"]}, ": sets the internal Normal SOP to run on vertices with a Cusp Angle of 60 and a Weighting Method of ", {"type": "q", "text": ["By Face Area"]}, "."]}], "extent": [21612, 22229]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Tangent Generation"], "extent": [22229, 22253], "body": [{"type": "para", "indent": 8, "text": ["It is recommended to let the node recompute the tangent attribute ", {"type": "q", "text": ["tangentu"]}, " for you using the MikkT method."], "extent": [22253, 22370]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Binormal Generation"], "extent": [22370, 22395], "body": [{"type": "para", "indent": 8, "text": ["The binormal attribute ", {"type": "q", "text": ["tangentv"]}, " is always recomputed to ensure consistency. How binormals are computed depends on ", {"type": "strong", "text": ["Target Engine"]}, ".\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Right-Hand Rule"]}, ": the binormal is computed from the cross product of the normal and the tangent."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["Left-Hand Rule"]}, ": the binormal is computed from the cross product of the tangent and the normal."]}], "extent": [22395, 22761]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Export"], "extent": [22761, 22776], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Export Path"], "extent": [22776, 22793], "body": [{"type": "para", "indent": 8, "text": ["The directory in which to export the files."], "extent": [22793, 22845]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Asset Name"], "extent": [22845, 22861], "body": [{"type": "para", "indent": 8, "text": ["The overall name of this art asset. The names of all exported files will begin with this string."], "extent": [22861, 22966]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Geometry Name Suffix"], "extent": [22966, 22992], "body": [{"type": "para", "indent": 8, "text": ["Appends a suffix to the static mesh’s file name right before the extension. Starting with Vertex Animation Textures ROP 3.0, the default workflow does not require you to export any real-time data file that contains the frame count and the FPS. The frame count is embedded and automatically derived by the real-time shader. The FPS should not change very often, so it is assumed that it is easier for you to simply remember the FPS than to export it every time. But in case you prefer to keep a copy of those numbers somewhere, this gives you an option to append them to the geometry file name. An alternative option available in Unreal Engine is to enter the debug mode to see the frame count (see the tooltip of Include Hidden Debug Plane in Geometry)."], "extent": [22992, 23754]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Include"], "extent": [23754, 23767], "body": [{"type": "para", "indent": 8, "text": ["Selects which of the following sets of files to render and export. Starting with Vertex Animation Textures ROP 3.0, Normal Texture is deprecated and replaced by Rotation Texture which describes both normals and tangents. Position Texture 2 and Spare Color Texture are not directly enabled/disabled here. They depend on parameters in the ", {"type": "strong", "text": ["Settings"]}, " tab. But you cannot export Position Texture 2 without Position Texture 1, and you cannot export Spare Color Texture without Color Texture."], "extent": [23767, 24262]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Geometry"], "extent": [24262, 24276], "body": [{"type": "para", "indent": 8, "text": ["The export path of the static mesh file."], "extent": [24276, 24325]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Position / Position 1"], "extent": [24325, 24352], "body": [{"type": "para", "indent": 8, "text": ["The export path of Position Texture."], "extent": [24352, 24397]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Position 2"], "extent": [24397, 24413], "body": [{"type": "para", "indent": 8, "text": ["The export path of Position Texture 2."], "extent": [24413, 24460]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Rotation"], "extent": [24460, 24474], "body": [{"type": "para", "indent": 8, "text": ["The export path of Rotation Texture."], "extent": [24474, 24519]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Color"], "extent": [24519, 24530], "body": [{"type": "para", "indent": 8, "text": ["The export path of Color Texture."], "extent": [24530, 24572]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Spare Color"], "extent": [24572, 24589], "body": [{"type": "para", "indent": 8, "text": ["The export path of Spare Color Texture."], "extent": [24589, 24637]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Lookup Table"], "extent": [24637, 24655], "body": [{"type": "para", "indent": 8, "text": ["The export path of Lookup Table Texture."], "extent": [24655, 24704]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Unity Material"], "extent": [24704, 24724], "body": [{"type": "para", "indent": 8, "text": ["The export path of Unity Material."], "extent": [24724, 24767]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Real-Time Data"], "extent": [24767, 24787], "body": [{"type": "para", "indent": 8, "text": ["The export path of Real-Time Data JSON file."], "extent": [24787, 24840]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Group Files into Subdirectories"], "extent": [24840, 24877], "body": [{"type": "para", "indent": 8, "text": ["By default, output files are grouped into subdirectories by type. Turn this off to save all output files in the same folder."], "extent": [24877, 25010]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Advanced"], "extent": [25010, 25027], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Live Update (Slow)"], "extent": [25027, 25051], "body": [{"type": "para", "indent": 8, "text": ["Only useful when debugging or modifying this node. When this is on, any update to the input geometry, the node parameters, or internal networks may trigger a partial or full recook, depending on where the change is made."], "extent": [25051, 25280]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Do Not Reset Live Update After Render"], "extent": [25280, 25323], "body": [{"type": "para", "indent": 9, "text": ["Only useful when debugging or modifying this node. When you press Render All, the node automatically turns on Live Update to enable a full recook of the internal networks. After the renders are complete, the node automatically turns Live Update off, which you can prevent with this parameter. It is useful so you can keep debugging after the renders."], "extent": [25323, 25683]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Allow Splitting Positions into Two HDR Textures"], "extent": [25683, 25736], "body": [{"type": "para", "indent": 8, "text": ["Normally it is a waste of resources to use two HDR Position Textures, so the access to Split Position into Two Textures is restricted when Texture Format is set to ", {"type": "q", "text": ["HDR"]}, ". You can override that restriction with this parameter."], "extent": [25736, 25970]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Allow Exporting Real-Time Data JSON File (Legacy)"], "extent": [25970, 26025], "body": [{"type": "para", "indent": 8, "text": ["Starting with Vertex Animation Textures 3.0, the default workflow does not require you to export any real-time data file. The long list of parameters written to the data file in the older versions are now embedded in the bounds of the static mesh and are automatically derived at runtime. However, you may still want to work with the legacy parameters in at least two situations:\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["1. you need to support real-time instancing; the instance transforms may corrupted the embedded data;"]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["2. you need to change the object’s bound scale in engine, which may corrupt the embedded data; however, you should rarely have any reason to change the bound scale, because unlike prior versions, the bounds now encompass the full visible area of the animation, i.e., the mesh will not be incorrectly culled when you move the camera. However, changing the actor/component/object scale is totally safe."]}], "extent": [26025, 26946]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Support Real-Time Instancing"], "extent": [26946, 26980], "body": [{"type": "para", "indent": 8, "text": ["Turn this on to support real-time instancing of your vertex-animated mesh. Currently this parameter only makes a difference if ", {"type": "strong", "text": ["Target Engine"]}, " is set to ", {"type": "q", "text": ["Unreal Engine"]}, ". In Unreal Engine, instanced meshes' local-space tangents are not directly accessible, so when ", {"type": "strong", "text": ["Mode"]}, " is set to ", {"type": "q", "text": ["Rigid-Body Dynamics (Rigid)"]}, ", the tangents have to come from the vertex attributes ", {"type": "q", "text": ["uv5"]}, " and ", {"type": "q", "text": ["uv6"]}, "."], "extent": [26980, 27370]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Crop Textures to First Frame Only"], "extent": [27370, 27409], "body": [{"type": "para", "indent": 8, "text": ["Crops the output textures so that they only contain the first frame’s data. (When this is on, ", {"type": "strong", "text": ["Pad Texture Size to Powers of Two"]}, " is ignored.)  This is useful in the real-time shader when you want to use a small texture to look up certain first-frame data regardless of the current animation progress. In Dynamic Remeshing (Fluid) mode, only Lookup Table Texture will be cropped, as the rest of the textures in this mode are not generated in a way that the first-frame data can be easily isolated."], "extent": [27409, 27915]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Preserve Raw Float Data in Position Alpha"], "extent": [27915, 27962], "body": [{"type": "para", "indent": 8, "text": ["Only applicable when ", {"type": "strong", "text": ["Crop Textures to First Frame Only"]}, " is on. The point attribute ", {"type": "q", "text": ["pscale"]}, " or any custom float attribute in Position Texture’s alpha channel, by default, is encoded in a special way to allow the packing of additional information. Turn this on to disable the special encoding and to store the raw input float data in this channel. This way, when you access Position Texture’s alpha channel in the real-time shader using a custom setup, you do not need to know how to decode the data. (This parameter has no effect on compressed normals, as they are not float data.)"], "extent": [27962, 28553]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Advanced: LODs"], "extent": [28553, 28576], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Export LODs"], "extent": [28576, 28593], "body": [{"type": "para", "indent": 8, "text": ["Exports a single FBX containing multiple LODs and a single set of textures compatible with all the LODs. All non-zero LODs simply share LOD0's textures through point-mapping (described below in requirement 1), so adding more LODs does not increase the texture memory consumption.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["The input geometry must meet the following requirements:"]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["1. all LODs must have the integer point attribute ", {"type": "q", "text": ["lod0_ptnum"]}, ". This attribute maps all the points in every non-zero LOD to a subset of points in LOD0, enabling subsequent LODs to share the point data exported with LOD0. In Rigid-Body Dynamics (Rigid) mode, this attribute should be on packed points."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["2. in each LOD, all the points must be assigned to the respective point group ", {"type": "q", "text": ["lod#"]}, " with ", {"type": "q", "text": ["#"]}, " being the LOD number starting with 0. In Rigid-Body Dynamics (Rigid) mode, this group should be on packed points instead of points."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["3. all LODs must already have the desired UVs and normals on vertices; this node cannot reliably auto-generate missing UVs and normals that are consistent across all LODs; therefore, it will not attempt to do so."]}], "extent": [28593, 29738]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Number of LODs"], "extent": [29738, 29758], "body": [{"type": "para", "indent": 8, "text": ["The number of LODs to export. At least this number of LODs must be present in the input geometry."], "extent": [29758, 29864]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Advanced: Scripts"], "extent": [29864, 29890], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Initialize Simulation OPs"], "extent": [29890, 29921], "body": [{"type": "para", "indent": 8, "text": ["Forces all simulation OPs to be reset before Pre-Render Script is executed. This is the safest way to render out a simulation, because it starts the simulation from scratch and discards any partial simulations you might have done with different parameters. However, throwing away an already-cooked simulation can be expensive, especially for relatively slow solvers such as fluids."], "extent": [29921, 30311]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Pre-Render Script"], "extent": [30311, 30334], "body": [{"type": "para", "indent": 8, "text": ["This script is executed before any rendering."], "extent": [30334, 30388]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Post-Render Script"], "extent": [30388, 30412], "body": [{"type": "para", "indent": 8, "text": ["This script is executed after all rendering."], "extent": [30412, 30465]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["PDG Log Output"], "extent": [30465, 30485], "body": [{"type": "para", "indent": 8, "text": ["Prints output file paths with optional tags."], "extent": [30485, 30538]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Advanced: Developer Options"], "extent": [30538, 30574], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Convert to Image Format Colorspace"], "extent": [30574, 30614], "body": [{"type": "para", "indent": 8, "text": ["Image data in COPs is always linear. When writing to image formats that are not linear (sRGB, for example), this will convert the colorspace to preserve the look of the image. An 8-bit format that has an unspecified colorspace is assumed to be sRGB."], "extent": [30614, 30872]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Raster Depth"], "extent": [30872, 30890], "body": [{"type": "para", "indent": 8, "text": ["The byte format of the image. Higher bit depths provide better color resolution and range at the expense of memory.\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["8 Bit Integer"]}, ": lowest bit depth; banding can occasionally be seen; suitable for video."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["16 Bit Integer"]}, ": intermediate bit depth; no banding can be seen, though clipping can still occur below and above the black and white points."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["32 Bit Integer"]}, ": generally not used for color, 32-bit integer values are used to store object IDs, counts, and other integer values with a large range."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["16 Bit Floating Point"]}, ": high bit depth; no banding can be seen, and no clipping occurs at white and black; uses less memory than 32-bit float, however processing time for this format is slightly higher as it is not a native CPU data format; this format supports values in the range -65504 to +65504."]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["32 Bit Floating Point"]}, ": high bit depth; no banding can be seen, and no clipping occurs at white and black; uses 4 times as much memory as 8 bit, which is this format’s main drawback."]}], "extent": [30890, 31958]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Black/White Points"], "extent": [31958, 31982], "body": [{"type": "para", "indent": 8, "text": ["The integer formats (8, 16 and 32 bit) can specify the raw values that the black and white points occur at. The white point must always be higher than the black point. The minimum and maximum values for the black and white points for each format are:\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["8 bit"]}, "   :   0 - 255"]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["16 bit"]}, "  :   0 - 65535"]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": [{"type": "strong", "text": ["32 bit"]}, "  :   0 - 2,147,483,647"]}, "\n        ", {"tag": "p", "attrs": {}, "type": "xml", "text": ["Floating point formats always have their black point at 0 and their white point at 1."]}], "extent": [31982, 32465]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["BC 4-Channel Split"], "extent": [32465, 32489], "body": [{"type": "para", "indent": 8, "text": ["Renders the channels separately for different data formats."], "extent": [32489, 32557]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Render With Take"], "extent": [32557, 32579], "body": [{"type": "para", "indent": 8, "text": ["You can optionally turn this on if you are working with takes."], "extent": [32579, 32650]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Target Engine"], "extent": [32650, 32672], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Coordinate System"], "extent": [32672, 32695], "body": [{"type": "para", "indent": 8, "text": ["Set this to match the coordinate system of your custom engine. You first need to determine your engine’s coordinate system. To use the clockwise rule, orient the axes so that all three positive directions are facing towards you; start from the up axis and count clockwise. To use the right/left-hand rule, take out the respective hand, extend the thumb and the index finger, and keep the middle finger perpendicular to the palm; the index finger points to +X, the middle finger +Y, and the thumb +Z."], "extent": [32695, 33203]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["1 Metre in Engine Units"], "extent": [33203, 33232], "body": [{"type": "para", "indent": 8, "text": ["How many target engine units equal one real-world metre. This is used to determine the export conversion scale."], "extent": [33232, 33352]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}, {"level": 2, "id": null, "container": true, "type": "h", "indent": 4, "text": ["Real-Time Shaders"], "extent": [33352, 33378], "body": [{"type": "parameters_item_group", "body": [{"type": "parameters_item", "indent": 4, "text": ["Find Shaders For"], "extent": [33378, 33400], "body": [{"type": "para", "indent": 8, "text": ["Displays the shader resources for the selected engine."], "extent": [33400, 33463]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Unreal Engine Content Plugin and Guides"], "extent": [33463, 33508], "body": [{"type": "para", "indent": 8, "text": ["Press this button to go to the directory of SideFX Labs content plugin for Unreal Engine. Click on the folder matching the Unreal Engine version you need. Follow the guides inside. "], "extent": [33508, 33698]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Unity Package and Guides"], "extent": [33698, 33728], "body": [{"type": "para", "indent": 8, "text": ["Press this button to go to the directory of SideFX Labs Vertex Animation Textures package for Unity. Click on the ", {"type": "q", "text": ["URP_VAT3"]}, " folder. Follow the guides inside."], "extent": [33728, 33895]}], "container": true, "role": "item"}, {"type": "parameters_item", "indent": 4, "text": ["Last Render’s Embedded Data"], "extent": [33895, 33928], "body": [{"type": "para", "indent": 8, "text": ["Displays the data embedded in the bounds of the geometry. You can use this list to verify if the decoded data in your real-time shader are correct. The list is ordered according to the data display order in the target engine. Currently only Unreal Engine supports debugging embedded data."], "extent": [33928, 34224]}], "container": true, "role": "item"}], "container": true, "role": "item_group"}]}], "text": "Parameters"}], "title": ["Labs Vertex Animation Textures"], "summary": [" The Vertex Animation Textures ROP will export a mesh and a set of textures to be used with a shader for complex real-time effects, such as: soft-body deformation, rigid-body dynamics, dynamically remeshed geometries, and particle sprites. "]}