{"type": "root", "attrs": {"type": "node", "context": "obj_state", "internal": "pose", "icon": "OBJ_STATE/pose", "index": "no", "redirect": "/char/pose_tool"}, "body": [{"level": 0, "type": "title", "indent": 0, "text": ["Pose Tool"], "extent": [0, 14]}, {"type": "summary", "indent": 0, "text": ["The Pose tool is used to pose characters by manipulating objects."], "extent": [124, 197]}, {"type": "para", "indent": 0, "text": ["The Pose tool is used to pose characters by manipulating objects. This\nis similar to the Objects tool except that it treats bones as a special\nfor superior interaction."], "extent": [197, 367]}, {"type": "para", "indent": 0, "text": ["Select the objects to manipulate, and right-click to complete the\noperation. You will be presented with one or more Pose handles for bones\nand Object-specific handles for the other object types. Each separate\nbone chain will be given its own Pose handle. Bone chains that branch\nwill have a separate Pose handle for each branch. Any bones that are\ncontrolled by an Inverse Kinematics solver will have a Pose handle\nattached to all the bones in that chain (even if not all of the bones\nwere selected). These handles let you manipulate the bones in a variety\nof ways, depending on the type of solver applied to the bone chain. To\ntransform more than one object at a time, change the Handle mode menu in\nthe Viewer Controls toolbar to Global Transform. This is also available\nvia the Ctrl+Right mouse menu."], "extent": [367, 1172]}, {"type": "para", "indent": 0, "text": ["For bone chains with an Inverse Kinematics solver, you can move the end\naffector and you can apply a twist. The twist will move the twist\naffector if there is one; otherwise, it will modify the Twist parameter\nof the solver."], "extent": [1172, 1398]}, {"type": "para", "indent": 0, "text": ["For bone chains with Forward Kinematics or no kinematics, you can select\nany bone in the chain and manipulate it directly. You can also select\nthe transform handle at the end of any joint, and manipulate the handle.\nDoing so will use inverse kinematics to assign new rotations to every\nbone higher up the chain. The transform handle is treated as if it were\nan end affector for the chain. For chains using Forward Kinematics, the\nbones are manipulated by transforming the end affector for each bone.\nFor chains with no kinematics, the bones are manipulated by changing the\nRotate parameter of the Bone objects."], "extent": [1398, 2010]}, {"type": "para", "indent": 0, "text": ["Any joint in the chain can also be locked by shift-left clicking on the\ntransform handle at that joint. Locked joints appear with their\ntransform handles solid shaded. Unlocked joints appear with their\ntransform handles in wireframe. When a joint is locked, modifications\nmade higher up the bone chain are not allowed to affect the position of\nthe locked joint."], "extent": [2010, 2373]}, {"type": "para", "indent": 0, "text": ["If Secure Selection is turned off, you can select any group of objects\nin the viewport. Pose handles will immediately appear for this new set\nof objects. You can also select bones in a network editor, and the\nhandles will appear for this new selection."], "extent": [2373, 2627]}, {"type": "para", "indent": 0, "text": ["WHAT TO DO NEXT"], "extent": [2627, 2644]}, {"type": "para", "indent": 0, "text": ["When posing the character, see if any capture weights need tweaking. If\nso, experiment with editing capture regions (the procedural approach) or\nwith Paint/Edit Capture Weights. Mirror Capture Weights will come in\nhandy if you have painted or hand-edited the weights of one limb and\nwant them reflected automatically to save time."], "extent": [2644, 2979]}], "title": ["Pose Tool"], "summary": ["The Pose tool is used to pose characters by manipulating objects."]}