{"type": "root", "attrs": {"type": "node", "context": "shop", "internal": "v_volumefire", "icon": "SHOP/v_volumefire", "version": null, "namespace": null}, "body": [{"level": 0, "type": "title", "indent": 0, "text": ["VEX Volume Fire"], "extent": [77, 97]}, {"type": "summary", "indent": 0, "text": [" This volume shader will shade volume objects as if they were flame.\nThe density value will be used as a lookup into a color shading ramp,\nprovided it lies within a certain range.\n"], "extent": [97, 286]}, {"type": "para", "indent": 0, "text": ["When attached to volume geometry, this shader will shade each point as\nif it were a flame. The value of the volume geometry is used both as\ndensity cut-off and as a lookup into a shading ramp.  If the density\nis below the low value, it will be transparent.  If it is over the\nhigh value and Hollow Interior is set, it will also be transparent.\nOtherwise, the density will be the Flame Density value (possibly\nmultiplied by the alpha if a texture map is used)"], "extent": [286, 746]}, {"type": "para", "indent": 0, "text": ["If no texture map is specified, the low, mid, and high colors will be\nused as the flame color for each of the specified density values.  If\na texture map is specified, its full width will be stretched into the\nlow to high value range and used.  An alpha on the texture map will\nmodulate the density accordingly."], "extent": [746, 1059]}, {"type": "para", "indent": 0, "text": ["The Shadow Density is used when shadow rays are cast\nthrough the flame, allowing for the flame to be transparent in the\nshadow pass."], "extent": [1059, 1193]}, {"type": "para", "indent": 0, "text": ["Because the fog is sampled internally, default shadow shaders like Fast\nShadow that return inside/outside will result in aliasing. If shadows do\nnot need to cast on the fog, they can be turned off easily in this SHOP.\nOtherwise, one should use deep shadow maps or another method of getting\nsoft shadows."], "extent": [1193, 1498]}, {"type": "para", "indent": 0, "text": ["The Emission parameter causes the fire to add light to the ray without\naffecting the opacity.  This allows the fire to blow out to white\nrather than blending into an ugly salmon color.  Emission is\nspecified in amount per unit distance sampled, so large values may be\nneeded for small fires."], "extent": [1498, 1790]}], "title": ["VEX Volume Fire"], "summary": [" This volume shader will shade volume objects as if they were flame.\nThe density value will be used as a lookup into a color shading ramp,\nprovided it lies within a certain range.\n"]}