{"type": "root", "attrs": {"type": "include"}, "body": [{"type": "dt_group", "body": [{"type": "dt", "indent": 0, "text": ["Material Model"], "extent": [16, 32], "body": [{"type": "para", "indent": 4, "text": ["Choose the model that determines how the material resists deformation. The Neo-Hookean material model is useful for simulating biological tissues (e.g., muscles and fat), and requires the ", {"type": "ui", "text": ["Solve Method"]}, " on the ", {"scheme": "Node", "value": "/nodes/dop/femsolver", "type": "link", "text": ["FEM Solver"], "fullpath": "/nodes/dop/femsolver"}, " to be set to ", {"type": "ui", "text": ["GNL"]}, "."], "extent": [56, 327]}], "container": true, "attrs": {"id": "materialmodel"}}, {"type": "dt", "indent": 0, "text": ["Shape Stiffness"], "extent": [327, 344], "body": [{"type": "para", "indent": 4, "text": ["This determines how strongly the Solid Object resists changes in shape. In the isotropic use case (Anisotropic Strength all 1), this physical constant is also known as shear modulus, modulus of rigidity, or Lame’s second parameter. If the units of length are set to meters, then the Shape Stiffness parameter has units of GPa."], "extent": [369, 701]}], "container": true, "attrs": {"id": "shapestiffness"}}, {"type": "dt", "indent": 0, "text": ["Volume Stiffness"], "extent": [701, 719], "body": [{"type": "para", "indent": 4, "text": ["This determines how strongly the Solid Object resists changes in volume. In the isotropic use case (Anisotropic Strength all 1), this physical constant is also known as Lame’s first parameter.  If the units of length are set to meters, then the Shape Stiffness parameter has units of GPa."], "extent": [745, 1039]}], "container": true, "attrs": {"id": "volumestiffness"}}, {"type": "dt", "indent": 0, "text": ["Damping Ratio"], "extent": [1039, 1054], "body": [{"type": "para", "indent": 4, "text": ["This value should lie between 0 and 1. It controls the rate of energy loss as a result of the rate of deformation. A value of 0 means that there is no loss of energy due to internal damping forces. A value of 1 means that the object is critically damped, in which case the object comes to rest in the quickest possible way without oscillating. The higher the damping ratio, the less the solid oscillates and the quicker the object’s motion will come to rest. The effect of damping is independent of your geometry’s resolution."], "extent": [1077, 1609]}], "container": true, "attrs": {"id": "dampingratio"}}, {"type": "dt", "indent": 0, "text": ["Mass Density"], "extent": [1609, 1623], "body": [{"type": "para", "indent": 4, "text": ["This is the mass per cubed length unit. The mass density can be made lower or higher in parts of the object using the primitive attribute ", {"type": "code", "text": ["volumemassdensity"]}, ", which works as a multiplier for the parameter. The higher the mass density, the less the object tends to accelerate as a result of any internal or external forces (F = m a, Newton’s second law)."], "extent": [1651, 2010]}], "container": true, "attrs": {"id": "volumemassdensity"}}, {"type": "dt", "indent": 0, "text": ["Enable Fracturing"], "extent": [2010, 2029], "body": [{"type": "para", "indent": 4, "text": ["This enables or disables all fracturing for this object."], "extent": [2060, 2130]}, {"type": "note_group", "body": [{"type": "note", "indent": 4, "role": "item", "extent": [2130, 2140], "body": [{"type": "para", "indent": 8, "text": ["Before any fracturing can occur, ", {"type": "ui", "text": ["Enable Fracturing"]}, " must also be enabled on the ", {"scheme": "Node", "value": "/nodes/dop/femsolver", "type": "link", "text": ["FEM Solver"], "fullpath": "/nodes/dop/femsolver"}, "."], "extent": [2140, 2265]}], "container": true}], "container": true, "role": "item_group"}], "container": true, "attrs": {"id": "enablefracturing"}}, {"type": "dt", "indent": 0, "text": ["Fracture Threshold"], "extent": [2265, 2285], "body": [{"type": "para", "indent": 4, "text": ["The amount of relative stretch that will cause the geometry to break up into separate parts during the simulation. For example, if the threshold is set to 0.1, the geometry will break in places where there is more than 10% stretch compared to the rest geometry."], "extent": [2313, 2580]}, {"type": "para", "indent": 4, "text": ["Realistic solid objects are not equally strong everywhere, there are weak parts that tend to fracture before any other parts. To create these relatively weaker parts you can create a vertex attribute called ", {"type": "code", "text": ["fracturethreshold"]}, ". This attribute is a multiplier for the ", {"type": "ui", "text": ["Fracture Threshold"]}, " parameter, so that you can still use the ", {"type": "ui", "text": ["Fracture Threshold"]}, " to control the overall strength of the object."], "extent": [2580, 2986]}], "container": true, "attrs": {"id": "fracturethreshold"}}, {"type": "dt", "indent": 0, "text": ["Friction Coefficient"], "extent": [2986, 3008], "body": [{"type": "para", "indent": 4, "text": ["The coefficient of friction of the object. A value of 0 means the object is frictionless. This governs how much the velocity that is tangential to the contact plane is affected by collisions. When two objects are in contact, the solver multiplies the friction coefficients of the involved object to get the effective friction coefficient for that contact."], "extent": [3027, 3388]}], "container": true, "attrs": {"id": "friction"}}, {"type": "dt", "indent": 0, "text": ["Anisotropic Strength"], "extent": [3388, 3410], "body": [{"type": "para", "indent": 4, "text": ["These values allow you to make the internal forces of the Solid Object behave in an anisotropic way; in that case, the amount of stress will differ depending on the direction in which the object is deformed. An example of an anisotropic material is wood, which has a different strength along the grain than perpendicular to the grain. The ", {"type": "code", "text": ["materialuvw"]}, " vertex or point attribute can be used to specify the internal directions of the Solid Object’s internal force model. For example, in the case of wood, the U direction could be aligned with the grain of the wood, while the VW coordinates are chosen perpendicular to the grain of the wood. In this case, the strength along the grain can be separately controlled using the U component of the ", {"type": "ui", "text": ["Anisotropic Strength"]}, "."], "extent": [3430, 4202]}], "container": true, "attrs": {"id": "aniso"}}], "container": true}]}