{"type": "root", "attrs": {"type": "include"}, "body": [{"type": "dt_group", "body": [{"type": "dt", "indent": 0, "text": ["Bounce"], "extent": [16, 24], "body": [{"type": "para", "indent": 4, "text": ["The elasticity of the object. If two objects of bounce 1.0 collide, they will rebound without losing energy. If two objects of bounce 0.0 collide, they will come to a standstill."], "extent": [24, 212]}], "container": true}, {"type": "dt", "indent": 0, "text": ["Bounce Forward"], "extent": [212, 228], "body": [{"type": "para", "indent": 4, "text": ["The tangential elasticity of the object. If two objects of bounce forward 1.0 collide, their tangential motion will be affected only by friction. If two objects of bounce forward 0.0 collide, their tangential motion will be matched."], "extent": [228, 470]}], "container": true}, {"type": "dt", "indent": 0, "text": ["Friction"], "extent": [470, 480], "body": [{"type": "para", "indent": 4, "text": ["The coefficient of friction of the object. A value of 0 means the object is frictionless. "], "extent": [480, 580]}, {"type": "para", "indent": 4, "text": ["This governs how much the tangential velocity is affected by collisions and resting contacts."], "extent": [580, 683]}], "container": true}, {"type": "dt", "indent": 0, "text": ["Dynamic Friction Scale"], "extent": [683, 707], "body": [{"type": "para", "indent": 4, "text": ["An object sliding may have a lower friction coefficient than an object at rest. This is the scale factor that relates the two. It is not a friction coefficient, but a scale between zero and one. "], "extent": [707, 912]}, {"type": "para", "indent": 4, "text": ["A value of one means that dynamic friction is equal to static friction. A scale of zero means that as soon as static friction is overcome the object acts without friction."], "extent": [912, 1093]}], "container": true}, {"type": "dt", "indent": 0, "text": ["Temperature"], "extent": [1093, 1106], "body": [{"type": "para", "indent": 4, "text": ["Temperature marks how warm or cool an object is.  This is used in gas simulations for ignition points of fuel or for buoyancy computations.  "], "extent": [1106, 1257]}, {"type": "para", "indent": 4, "text": ["Since this does not relate directly to any real world temperature scale, ambient temperature is usually considered 0."], "extent": [1257, 1379]}], "container": true}], "container": true}]}