{"type": "root", "attrs": {"type": "include"}, "body": [{"type": "dt_group", "body": [{"type": "dt", "indent": 0, "text": ["Sampling Mode"], "extent": [15, 30], "body": [{"type": "para", "indent": 4, "text": ["Controls how the force is sampled over space.  The behavior will\n    vary depending on the solver.  Fluid solvers will always sample\n    per-voxel, but RBD solvers can switch between sampling only the\n    centroid, only the surface, or the entire volume."], "extent": [30, 290]}, {"type": "dt_group", "body": [{"type": "dt", "indent": 4, "text": ["Default"], "extent": [290, 303], "body": [{"type": "para", "indent": 12, "text": ["Each force type has its own idea of the optimal sampling mode. For uniform forces, for example, only one sample is taken, the equivalent of Point.  But with a Field Force that is expected to vary over space, the Sphere sampling mode is the default when Treat as Wind is false, otherwise the Circle sampling mode is used."], "extent": [303, 637]}], "container": true}, {"type": "dt", "indent": 4, "text": ["Point"], "extent": [637, 648], "body": [{"type": "para", "indent": 12, "text": ["Perform a single force evaluation at the center of the object, treating this one value as a constant force for the object. This is the most efficient approach but does not allow for any nuances, for example, of an off-center fan causing an object to start spinning."], "extent": [648, 927]}], "container": true}, {"type": "dt", "indent": 4, "text": ["Circle"], "extent": [927, 939], "body": [{"type": "para", "indent": 12, "text": ["Perform a force evaluation on the surface of the object.  This is useful for forces such as wind that one wants to apply non-uniformally depending on the orientation of the object."], "extent": [939, 1133]}], "container": true}, {"type": "dt", "indent": 4, "text": ["Sphere"], "extent": [1133, 1145], "body": [{"type": "para", "indent": 12, "text": ["Perform a force evaluation throughout the volume of the object.  This is useful for forces which you want to respect the shape of the object.  The number of samples is proportional to the SDF resolution of RBD Objects, however, so can get very expensive."], "extent": [1145, 1412]}], "container": true}], "container": true}], "container": true}], "container": true}]}