{"type": "root", "attrs": {"type": "include"}, "body": [{"type": "dt_group", "body": [{"type": "dt", "indent": 0, "text": ["Collide with objects in other solvers"], "extent": [16, 55], "body": [{"type": "para", "indent": 4, "text": ["If enabled, the geometry in this object will collide with external objects that belong to a different solver. These other objects may be ", {"scheme": "Node", "value": "/nodes/dop/staticobject", "type": "link", "text": ["Static Objects"], "fullpath": "/nodes/dop/staticobject"}, ", ", {"scheme": "Node", "value": "/nodes/dop/rbdobject", "type": "link", "text": ["RBD Objects"], "fullpath": "/nodes/dop/rbdobject"}, ", or the ", {"scheme": "Node", "value": "/nodes/dop/groundplane", "type": "link", "text": ["Ground Plane"], "fullpath": "/nodes/dop/groundplane"}, ". When ", {"type": "ui", "text": ["Collision Detection"]}, " is set to Use Volume Collisions on the Static Object, then the polygon vertices will be tested for collision against the signed distance field (SDF) of the Static Object. When ", {"type": "ui", "text": ["Collision Detection"]}, " is set to Use Surface Collisions, then surface-based continuous collision detection is used. The surface-based collisions collide points against polygons, and edges against edges."], "extent": [84, 757]}, {"type": "para", "indent": 4, "text": ["When surface-based collisions are used, only polygons and tetrahedrons are considered. Other types of primitives, for example spheres, are be ignored. The geometry of the external objects (e.g. Static Object) is treated as being one-sided; only the outside of the polygons, determined by the winding order, opposes collisions."], "extent": [757, 1089]}, {"type": "para", "indent": 4, "text": ["When volume-based collisions are enabled, only points will be colliding against the volumes, not the interiors of polygons and tetrahedrons. When colliding against small volumes, this may mean that you need to increase the number of points on your mesh to get accurate collision results."], "extent": [1089, 1382]}], "container": true, "attrs": {"id": "collideindependent"}}, {"type": "dt", "indent": 0, "text": ["Collide with objects in this solver"], "extent": [1382, 1419], "body": [{"type": "para", "indent": 4, "text": ["When enabled, this object will collide with other objects that have the same solver. These collisions are handled using continuous collision detection, based on the geometry (polygons and/or tetrahedrons). For collisions between objects on the same solver, the polygons are treated as two-sided. Both sides of the polygons collide. The surface of a tetrahedral mesh only collides on one side: the outside."], "extent": [1448, 1859]}], "container": true, "attrs": {"id": "collidecodependent"}}, {"type": "dt", "indent": 0, "text": ["Collide with self"], "extent": [1859, 1878], "body": [{"type": "para", "indent": 4, "text": ["If enabled, any two distinct polygons or tetrahedrons that belong on the same object may collide with each other. This prevents the simulation geometry from penetrating itself. Self collisions are handled using surface-based continuous collision detection. All polygons are treated as two-sides, and all tetrahedrons collide only on the outside."], "extent": [1900, 2251]}], "container": true, "attrs": {"id": "collideself"}}, {"type": "dt", "indent": 0, "text": ["Thickness"], "extent": [2251, 2262], "body": [{"type": "para", "indent": 4, "text": ["Creates an imaginary layer around the object. This layer consists of the region of space that has a distance of at most ", {"type": "ui", "text": ["Thickness"]}, " to some polygon or tetrahedron. For two-sided collision surfaces, such as cloth geometry, the layer is applied to both sides of each polygon.        For one-sided collision surfaces, such as tetrahedron surfaces the thickness layer is applied only on the back side of the tetrahedron surface (in the interior of the tetrahedron). The ", {"scheme": null, "value": "node:dop/femsolver", "type": "link", "text": ["FEM Solver"], "exists": true}, " tries to ensure that the layers for the objects don’t penetrate each other or pass through each other."], "extent": [2282, 2890]}, {"type": "para", "indent": 4, "text": ["For example, when a pair of two-sided polygons collide, one with a thickness of 0.01 and one with a thickness of 0.02, the solver will try to separate polygons of these objects by a distance of 0.03. "], "extent": [2890, 3096]}, {"type": "para", "indent": 4, "text": ["The ", {"type": "ui", "text": ["Thickness"]}, " parameter is one of the very few parameters that is scale dependent. It is very important that you adjust this parameter when you change the scale or amount of detail of your geometry."], "extent": [3096, 3304]}, {"type": "para", "indent": 4, "text": ["Use a ", {"type": "ui", "text": ["Thickness"]}, " that is significantly smaller than the length of the shortest edge in your simulation geometry. Typically, the ", {"type": "ui", "text": ["Thickness"]}, " should not exceed 1% percent of the average edge length. To avoid problems with self collisions, you should keep the polygons (and/or tetrahedrons) in your geometry fairly even-sized. Avoid polygons that have very small edges, compared to the average size of the polygons in your cloth geometry."], "extent": [3304, 3751]}], "container": true, "attrs": {"id": "thickness"}}, {"type": "dt", "indent": 0, "text": ["Friction"], "extent": [3751, 3761], "body": [{"type": "para", "indent": 4, "text": ["The coefficient of friction of the object. A value of 0 means the object is frictionless. This governs how much the velocity that is tangential to the contact plane is affected by collisions. When two objects are in contact, then the solver multiplies the friction coefficients of the involved object to get the effective friction coefficient for that contact."], "extent": [3780, 4146]}], "container": true, "attrs": {"id": "friction"}}], "container": true}]}